garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12LF1571.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM3TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrnnn--" edc:cname="PWM3CON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="PWM3CON" edc:nzwidth="8" edc:por="000000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM3MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM3MODE" edc:desc="" edc:mask="0x3" edc:name="PWM3MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM3POL" edc:desc="" edc:mask="0x1" edc:name="PWM3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OE" edc:desc="" edc:mask="0x1" edc:name="PWM3OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN" edc:desc="" edc:mask="0x1" edc:name="PWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM3INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM3INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM3INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM3PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM3DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM3PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM3OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----cccc" edc:cname="PWM3INTF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM3INTF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM3INTFLG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIF" edc:desc="" edc:mask="0x1" edc:name="DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIF" edc:desc="" edc:mask="0x1" edc:name="PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIF" edc:desc="" edc:mask="0x1" edc:name="OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3PRIF" edc:desc="" edc:mask="0x1" edc:name="PWM3PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3DCIF" edc:desc="" edc:mask="0x1" edc:name="PWM3DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PHIF" edc:desc="" edc:mask="0x1" edc:name="PWM3PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OFIF" edc:desc="" edc:mask="0x1" edc:name="PWM3OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM3CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM3CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3CS0" edc:desc="" edc:mask="0x1" edc:name="PWM3CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3CS1" edc:desc="" edc:mask="0x1" edc:name="PWM3CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PS0" edc:desc="" edc:mask="0x1" edc:name="PWM3PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PS1" edc:desc="" edc:mask="0x1" edc:name="PWM3PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PS2" edc:desc="" edc:mask="0x1" edc:name="PWM3PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM3CS" edc:desc="" edc:mask="0x3" edc:name="PWM3CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3PS" edc:desc="" edc:mask="0x7" edc:name="PWM3PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PWM3LDCON" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PWM3LDCON" edc:nzwidth="8" edc:por="00----00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x3" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM3LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3LDS1" edc:desc="" edc:mask="0x1" edc:name="PWM3LDS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM3LDS" edc:desc="" edc:mask="0x3" edc:name="PWM3LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM3LDM" edc:desc="" edc:mask="0x1" edc:name="PWM3LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3LD" edc:desc="" edc:mask="0x1" edc:name="PWM3LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:desc="" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM3OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM3OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM3OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM3OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM3OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM3OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM3OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM3OFS" edc:desc="" edc:mask="0x3" edc:name="PWM3OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM3OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM3OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OFM" edc:desc="" edc:mask="0x3" edc:name="PWM3OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xea0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:AdjustPoint edc:offset="88" edc:_addr="0xF8C"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx" edc:_addr="0xFE4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
